// Capitalize
// 📝 Условие задачи
// Реализуйте Capitalize<T>, который конвертирует первый символ строки в верхний регистр.

// Пример
//type capitalized = Capitalize<'hello world'> // expected to be 'Hello world'

type MyCapitalize<S extends string> = S extends `${infer Head}${infer Tail}` ? `${Uppercase<Head>}${Tail}` : S;

//Порядок действий:
// Разделить строку на ${ПервыйСимвол}${Хвост}.
// Превратить ${ПервыйСимвол} в ${Uppercase<ПервыйСимвол>}.
// Склеить обратно с ${Хвост}.
// Если строка пустая — вернуть её как есть.
