// Awaited (Распаковка Promise)
// 📝 Условие задачи
// Реализуйте тип MyAwaited<T>, который работает аналогично встроенному Awaited.
// Он должен "развернуть" Promise и получить тип возвращаемого значения. Если Promise вложенный (Promise<Promise<string>>), он должен разворачивать их рекурсивно до самого дна.

// Пример использования:

// // Простой Promise
// type X = MyAwaited<Promise<string>>;
// // Ожидается: string

// // Вложенный Promise
// type Y = MyAwaited<Promise<Promise<number>>>;
// // Ожидается: number

// // Объект с интерфейсом Promise (PromiseLike)
// interface User { name: string; age: number }
// type Z = MyAwaited<Promise<User>>;
// // Ожидается: User

interface User {
    name: string;
    age: number;
    role: "admin" | "user";
}

type ApiUser = myAwaited<Promise<Promise<User>>>;

type myAwaited<T> = T extends PromiseLike<infer T1> ? myAwaited<T1> : T;

// Как это работает?
// Мы используем три мощных инструмента TypeScript:

// PromiseLike: Вместо жесткой привязки к Promise, мы проверяем на PromiseLike.
// Это покрывает и обычные промисы, и кастомные объекты, у которых есть метод .then (что соответствует стандарту Promises/A+).

// infer R: Ключевое слово infer позволяет нам "вытащить" тип, который находится внутри дженерика.

// Если T это Promise<string>, то infer R захватит string.
// Рекурсия:

// Условие: T extends PromiseLike<infer R>?
// Да: Мы нашли что-то внутри промиса (R). Но вдруг там внутри еще один промис? Поэтому мы снова вызываем MyAwaited<R> для найденного типа.
// Нет: Если T больше не похож на Promise (например, мы добрались до string или User), мы просто возвращаем T.

// Пошаговое выполнение: MyAwaited<Promise<Promise<number>>>
// Шаг 1: Вход Promise<Promise<number>>.

// Это PromiseLike? Да.
// infer R захватывает внутренность: Promise<number>.
// Вызываем рекурсию: MyAwaited<Promise<number>>.
// Шаг 2: Вход Promise<number>.

// Это PromiseLike? Да.
// infer R захватывает внутренность: number.
// Вызываем рекурсию: MyAwaited<number>.
// Шаг 3: Вход number.

// Это PromiseLike? Нет.
// Возвращаем T (number).

// 📚 Полезные концепции
// infer: Вывод типа внутри условного выражения.
// Recursive Types: Способность типа ссылаться на самого себя.
// PromiseLike<T>: Утилитный тип для совместимости с любыми объектами-промисами.
