// Exclude (Исключение типа)
// 📝 Условие задачи
// Реализуйте встроенную утилиту Exclude<T, U>.
// Она должна исключить из типа T те типы, которые присутствуют в U.

// Пример использования:

type Role = "guest" | "editor" | "admin";

type nonAdmin = MyExclude<Role, "admin">;
// // Ожидается: "guest" | "editor"

type MyExclude<T, P> = T extends P ? never : T;

//Если передать Union (объединение) в дженерик, TypeScript разбивает его и проверяет каждый элемент отдельно.

//Пример: MyExclude<'guest' | 'admin', 'admin'>
// TypeScript разбивает это на два независимых условия:

// Проверка 'guest':
// 'guest' extends 'admin'?

// Нет.
// Возвращаем T ('guest').
// Проверка 'admin':
// 'admin' extends 'admin'?

// Да.
// Возвращаем never (удаляем).
// Итог:
// 'guest' | never превращается просто в 'guest'.

// 📚 Полезные концепции
// Conditional Types (extends ? :): Тернарный оператор для типов.
// Distributive Conditional Types: Свойство распределения объединений в условных типах.
// Type never: Используется для удаления ветви типа из итогового объединения.
