// Omit (Исключение полей)
// 📝 Условие задачи

// Реализуйте встроенную утилиту Omit<T, K>.
// Она создает новый тип, выбирая все свойства из объекта T, а затем удаляет из них те, которые указаны в списке K.

// Пример:
interface Todo {
    title: string;
    description: string;
    completed: boolean;
}

// Мы хотим создать тип, в котором будет только 'description'
// Поле 'description' нам не нужно.
type TodoPreview1 = MyOmit<Todo, "title" | "completed">;

// В итоге TodoPreview должен быть эквивалентен такому типу:
// {
//     description: string;
// }

// Solution
//
type MyOmit<T, K extends keyof T> = {
    [P in keyof T as P extends K ? never : P]: T[P];
};

//1. [P in keyof T ...]:
// Мы запускаем цикл по всем ключам объекта Todo ("title", "description", "completed").

// 2.
// ... as P extends K ? never : P]:
// Это фильтр ключей. Мы спрашиваем: "Текущий ключ P входит в список запрещенных K?"

// Да (extends K): Превращаем ключ в never. В мире объектов ключ never означает "этого свойства не будет", оно удаляется.
// Нет: Оставляем ключ P как есть.
// 3.
// : T[P]:
// Значение оставляем таким же, каким оно было в исходном объекте.

// 📚 Полезные концепции
// Key Remapping (as): Позволяет трансформировать ключи в Mapped Types.
// Filtering keys: Использование never в ключе для удаления свойства.
// Mapped Types: Перебор свойств объекта.
